SmartiCo/smartico/hardware/esp8266/1.0.0/boards.txt
menu.BoardModel=Model
menu.ESPModule=Module
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support

##########################################################
nodemcuv2.name=SmartiCo ESP-12F with rboot
nodemcuv2.build.board=ESP8266_NODEMCU
nodemcuv2.build.variant=nodemcu
nodemcuv2.bootloader.tool=esptool
nodemcuv2.bootloader.file=caterina/Caterina-Yun.hex
nodemcuv2.upload.tool=esptool
nodemcuv2.upload.maximum_data_size=81920
nodemcuv2.upload.wait_for_upload_port=true
nodemcuv2.upload.erase_cmd=
nodemcuv2.serial.disableDTR=true
nodemcuv2.serial.disableRTS=true
nodemcuv2.build.mcu=esp8266
nodemcuv2.build.core=esp8266:esp8266
nodemcuv2.build.spiffs_pagesize=256
nodemcuv2.build.debug_port=
nodemcuv2.build.debug_level=
nodemcuv2.menu.xtal.160=160 MHz
nodemcuv2.menu.xtal.160.build.f_cpu=160000000L
nodemcuv2.menu.vt.flash=Flash
nodemcuv2.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
nodemcuv2.menu.vt.heap=Heap
nodemcuv2.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
nodemcuv2.menu.vt.iram=IRAM
nodemcuv2.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
nodemcuv2.menu.exception.legacy=Legacy (new can return nullptr)
nodemcuv2.menu.exception.legacy.build.exception_flags=-fno-exceptions
nodemcuv2.menu.exception.legacy.build.stdcpp_lib=-lstdc++
nodemcuv2.menu.exception.disabled=Disabled (new can abort)
nodemcuv2.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
nodemcuv2.menu.exception.disabled.build.stdcpp_lib=-lstdc++
nodemcuv2.menu.exception.enabled=Enabled
nodemcuv2.menu.exception.enabled.build.exception_flags=-fexceptions
nodemcuv2.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
nodemcuv2.menu.ssl.all=All SSL ciphers (most compatible)
nodemcuv2.menu.ssl.all.build.sslflags=
nodemcuv2.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
nodemcuv2.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
nodemcuv2.upload.resetmethod=--before default_reset --after hard_reset
nodemcuv2.build.flash_mode=dio
nodemcuv2.build.flash_flags=-DFLASHMODE_DIO
nodemcuv2.build.flash_freq=40m

nodemcuv2.menu.eesz.4M512KSLOT1=512KB ROM in SLOT 1
nodemcuv2.menu.eesz.4M512KSLOT1.build.flash_size=4MB
nodemcuv2.menu.eesz.4M512KSLOT1.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M512KSLOT1.build.flash_ld=rboot.flash.4m512k.slot1.ld
nodemcuv2.menu.eesz.4M512KSLOT1.build.spiffs_pagesize=256
########## 516096 = 512KB - 8KB
nodemcuv2.menu.eesz.4M512KSLOT1.upload.maximum_size=516096
nodemcuv2.menu.eesz.4M512KSLOT1.upload.start_address=0x2000
nodemcuv2.menu.eesz.4M512KSLOT1.build.rfcal_addr=0x3FC000
nodemcuv2.menu.eesz.4M512KSLOT1.build.spiffs_start=0x200000
nodemcuv2.menu.eesz.4M512KSLOT1.build.spiffs_end=0x3FA000
nodemcuv2.menu.eesz.4M512KSLOT1.build.spiffs_blocksize=8192

nodemcuv2.menu.eesz.4M512KSLOT2=512KB ROM in SLOT 2
nodemcuv2.menu.eesz.4M512KSLOT2.build.flash_size=4MB
nodemcuv2.menu.eesz.4M512KSLOT2.build.flash_size_bytes=0x400000
nodemcuv2.menu.eesz.4M512KSLOT2.build.flash_ld=rboot.flash.4m512k.slot2.ld
nodemcuv2.menu.eesz.4M512KSLOT2.build.spiffs_pagesize=256
########## 516096 = 512KB - 8KB
nodemcuv2.menu.eesz.4M512KSLOT2.upload.maximum_size=516096
nodemcuv2.menu.eesz.4M512KSLOT2.upload.start_address=0x82000
nodemcuv2.menu.eesz.4M512KSLOT2.build.rfcal_addr=0x3FC000
nodemcuv2.menu.eesz.4M512KSLOT2.build.spiffs_start=0x100000
nodemcuv2.menu.eesz.4M512KSLOT2.build.spiffs_end=0x3FA000
nodemcuv2.menu.eesz.4M512KSLOT2.build.spiffs_blocksize=8192

nodemcuv2.menu.led.2=2
nodemcuv2.menu.led.2.build.led=-DLED_BUILTIN=2
nodemcuv2.menu.ip.lm2f=v2 Lower Memory
nodemcuv2.menu.ip.lm2f.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
nodemcuv2.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
nodemcuv2.menu.ip.hb2f=v2 Higher Bandwidth
nodemcuv2.menu.ip.hb2f.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
nodemcuv2.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
nodemcuv2.menu.ip.lm2n=v2 Lower Memory (no features)
nodemcuv2.menu.ip.lm2n.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.lm2n.build.lwip_lib=-llwip2-536
nodemcuv2.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
nodemcuv2.menu.ip.hb2n=v2 Higher Bandwidth (no features)
nodemcuv2.menu.ip.hb2n.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
nodemcuv2.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
nodemcuv2.menu.ip.lm6f=v2 IPv6 Lower Memory
nodemcuv2.menu.ip.lm6f.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
nodemcuv2.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
nodemcuv2.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
nodemcuv2.menu.ip.hb6f.build.lwip_include=lwip2/include
nodemcuv2.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
nodemcuv2.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
nodemcuv2.menu.ip.hb1=v1.4 Higher Bandwidth
nodemcuv2.menu.ip.hb1.build.lwip_lib=-llwip_gcc
nodemcuv2.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
nodemcuv2.menu.ip.src=v1.4 Compile from source
nodemcuv2.menu.ip.src.build.lwip_lib=-llwip_src
nodemcuv2.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
nodemcuv2.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
nodemcuv2.menu.dbg.Disabled=Disabled
nodemcuv2.menu.dbg.Disabled.build.debug_port=
nodemcuv2.menu.dbg.Serial=Serial
nodemcuv2.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
nodemcuv2.menu.dbg.Serial1=Serial1
nodemcuv2.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
nodemcuv2.menu.lvl.None____=None
nodemcuv2.menu.lvl.None____.build.debug_level=
nodemcuv2.menu.lvl.SSL=SSL
nodemcuv2.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
nodemcuv2.menu.lvl.TLS_MEM=TLS_MEM
nodemcuv2.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
nodemcuv2.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
nodemcuv2.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
nodemcuv2.menu.lvl.HTTP_SERVER=HTTP_SERVER
nodemcuv2.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
nodemcuv2.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
nodemcuv2.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
nodemcuv2.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
nodemcuv2.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
nodemcuv2.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
nodemcuv2.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nodemcuv2.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
nodemcuv2.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
nodemcuv2.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
nodemcuv2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nodemcuv2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcuv2.menu.lvl.CORE=CORE
nodemcuv2.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
nodemcuv2.menu.lvl.WIFI=WIFI
nodemcuv2.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
nodemcuv2.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
nodemcuv2.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
nodemcuv2.menu.lvl.UPDATER=UPDATER
nodemcuv2.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
nodemcuv2.menu.lvl.OTA=OTA
nodemcuv2.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
nodemcuv2.menu.lvl.OOM=OOM
nodemcuv2.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
nodemcuv2.menu.lvl.MDNS=MDNS
nodemcuv2.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
nodemcuv2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
nodemcuv2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
nodemcuv2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
nodemcuv2.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
nodemcuv2.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
nodemcuv2.menu.baud.115200=115200
nodemcuv2.menu.baud.115200.upload.speed=115200
###################################################################################